### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [70]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)
df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [43]:
total_players = df['SN'].count()
total_players

780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [71]:
items = np.unique(df['Item Name'])
total_items = len(items)
total_items

179

In [96]:
avg_price = df['Price'].mean()
price = (round(avg_price))
price

3

In [82]:
avg_age = df['Age'].mean()
age = round(avg_age)
age

23

In [83]:
purchase_table = ({'Total Items': [total_items], 'Total Players': [total_players], 'Average Price': [price], 'Average Age': [age]})
purchase_table = pd.DataFrame(purchase_table)
purchase_table

   Total Items  Total Players  Average Price  Average Age
0          179            780              3           23




## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [77]:
male = []

for x in df['Gender']:
    if x == 'Male':
        male.append(x)
male_count = len(male)

perc_men = round((male_count/total_players)*100,2)
perc_men

83.59

In [78]:
female = []
for x in df['Gender']:
    if x == 'Female':
        female.append(x)
female_count = len(female)

perc_women = round((female_count/total_players)*100,2)
print(perc_women)

14.49

In [81]:
ND = []
for x in df['Gender']:
    if x == 'Other / Non-Disclosed':
        ND.append(x)
ND_count = len(ND)

perc_ND = round((ND_count/total_players)*100,2)
print(perc_ND)

1.92


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [87]:
female_data = df.loc[df["Gender"] == "Female"]
female_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [120]:
male_data = df.loc[df['Gender'] == 'Male']
male_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [141]:
women = np.unique(female_data['SN'])
total_women = len(women)

In [142]:
men = np.unique(male_data['SN'])
total_men = len(men)

In [152]:
wtotal = female_data['Price'].sum()

In [150]:
mtotal = male_data['Price'].sum()

In [145]:
fpurchase_count = female_data['Purchase ID'].count()

In [146]:
mpurchase_count = male_data['Purchase ID'].count()

In [147]:
favg_price = female_data['Price'].mean()

In [153]:
mavg_price = male_data['Price'].mean()

In [188]:
favg_total = wtotal / total_women

In [189]:
mavg_total = mtotal / total_men

In [272]:
gender_analysis = pd.DataFrame([
    {"Gender": "Female", "Purchase Count": fpurchase_count, "Average Price": favg_price, 'Avg Purchase Total Per Person': favg_total},
    {"Gender": "Male", "Purchase Count": mpurchase_count, "Average Price": mavg_price, 'Avg Purchase Total Per Person': mavg_total}
])
gender_analysis

   Average Price  Avg Purchase Total Per Person  Gender  Purchase Count
0       3.203009                       4.468395  Female             113
1       3.017853                       4.065372    Male             652

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [157]:
bins = [0, 15, 20, 25, 30, 35, 40, 100]

labels = ['<15', '15-19', '20-24', '25-29', '30-34', '35-39', '40>']

In [158]:
pd.cut(df["Age"], bins, labels=labels).head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (7, object): [<15 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40>]

In [161]:
df["Age Group"] = pd.cut(df["Age"], bins, labels=labels)
df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [185]:
age_group = df.groupby("Age Group")

total_people = age_group['Age'].count()

total_purchases = age_group['Purchase ID'].count()

total_price = age_group["Price"].sum()

avg_price = age_group["Price"].mean()

perc_age = round(total_players / total_people)
perc_age

Age Group
<15        9.0
15-19      4.0
20-24      2.0
25-29     10.0
30-34     15.0
35-39     24.0
40>      111.0
Name: Age, dtype: float64

In [224]:
age_analysis = pd.DataFrame({
    "Average Purchase Price": avg_price,
     "Total People": total_people,
    "Total Purchuases": total_purchases,
     "Total Spent": total_price})
age_analysis

           Average Purchase Price  Total People  Total Purchuases  Total Spent
Age Group
<15                      3.087907            86                86       265.56
15-19                    3.107800           200               200       621.56
20-24                    3.020431           325               325       981.64
25-29                    2.875584            77                77       221.42
30-34                    2.994423            52                52       155.71
35-39                    3.404545            33                33       112.35
40>                      3.075714             7                 7        21.53

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [233]:
# SN(Index), Purchase Count, Avg Purchase Price, Total Purchase price

SN_data = df.groupby(['SN'])
purchase_count = SN_data['Purchase ID'].count()
avg_purch_price = SN_data['Price'].mean()
total_purch_price = SN_data['Price'].sum()

In [265]:
topspend_analysis = pd.DataFrame({
    "Total Purchases": purchase_count,
     "Total Purchase Price": total_purch_price,
    "Average Purchase Price": avg_purch_price,})
topspend_analysis.head(5)

              Total Purchases  Total Purchase Price  Average Purchase Price
SN
Adairialis76                1                  2.28                    2.28
Adastirin33                 1                  4.48                    4.48
Aeda94                      1                  4.91                    4.91
Aela59                      1                  4.32                    4.32
Aelaria33                   1                  1.79                    1.79

In [266]:
topspenders = topspend_analysis.sort_values("Total Purchases", ascending=False)
topspenders.head(5)

             Total Purchases  Total Purchase Price  Average Purchase Price
SN
Lisosia93                  5                 18.96                3.792000
Iral74                     4                 13.62                3.405000
Idastidru52                4                 15.45                3.862500
Asur53                     3                  7.44                2.480000
Inguron55                  3                 11.11                3.703333

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [250]:
reduced_df = df.loc[:, ["Item ID", "Item Name", "Price"]]
reduced_df.head(5)

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [263]:
ID_name = reduced_df.groupby(['Item ID', 'Item Name'])
purch_count = ID_name['Item Name'].count()
item_price = ID_name['Price'].sum()
purchase_value = item_price * purch_count

In [264]:
item_analysis = pd.DataFrame({
    "Purchase Count": purch_count,
    "Item Price": item_price,
     "Total Purchase Value": purchase_value})
item_analysis.head(5)

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        5.12                 20.48
1       Crucifer                         3        9.78                 29.34
2       Verdict                          6       14.88                 89.28
3       Phantomlight                     6       14.94                 89.64
4       Bloodlord's Fetish               5        8.50                 42.50

In [267]:
mostpopular = item_analysis.sort_values("Purchase Count", ascending=False)
mostpopular.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,609.12
145,Fiery Glass Crusader,9,41.22,370.98
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,285.93
82,Nirvana,9,44.10,396.90
19,"Pursuit, Cudgel of Necromancy",8,8.16,65.28

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [269]:
most_profitable = item_analysis.sort_values('Total Purchase Value', ascending=False)
most_profitable.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,609.12
82,Nirvana,9,44.10,396.90
145,Fiery Glass Crusader,9,41.22,370.98
92,Final Critic,8,39.04,312.32
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,285.93